PeepOrange/STM32F103ZET6_ogistics_handling_robot/User/config.cpp
#include "config.h"
#include "gpio.h"
#include "oled.h"
#include "EXTI.h"
#include "uart.h"
#include "dma.h"
#include "iic_cs.h"
#include "adc.h"
#include "tim.h"
#include "dac.h"
#include "spi.h"
#include "flash.h"
#include "ILI9341_LCD.h"
#include "OV7725.h"
#include "ESP8266.h"
#include "W25Q64.h"

#ifdef __cplusplus
extern "C"
{
#include "system.h"
#include "stm32f10x_it.h"
#include "stm32f10x.h"                  // Device header
#include "os.h"
};
#endif






#ifdef __cplusplus
extern "C"
{
#endif 

//X 、Y 轴坐标
char Pos_X,Pos_Y;


 PID  LeftUp_PID_Mortor={0,0,0,0,Encoder_read_num_Proportion,Encoder_read_num_Integral,Encoder_read_num_Derivative};
 PID  LeftBack_PID_Mortor={0,0,0,0,Encoder_read_num_Proportion,Encoder_read_num_Integral,Encoder_read_num_Derivative};
 PID  RightUp_PID_Mortor={0,0,0,0,Encoder_read_num_Proportion,Encoder_read_num_Integral,Encoder_read_num_Derivative};
 PID  RightBack_PID_Mortor={0,0,0,0,Encoder_read_num_Proportion,Encoder_read_num_Integral,Encoder_read_num_Derivative};


    
    

void LED_Init()
{

    
    GPIO LED1(GPIOE,GPIO_Pin_5);
    GPIO LED2(GPIOE,GPIO_Pin_6);

    
    LED1.mode(GPIO_Mode_Out_PP,GPIO_Speed_50MHz);
    LED2.mode(GPIO_Mode_Out_PP,GPIO_Speed_50MHz);

    LED1.set();

    LED2.set();
    
    
}    
    
    
void LED_ALL_OFF()
{
    GPIO LED1(GPIOE,GPIO_Pin_5);
    GPIO LED2(GPIOE,GPIO_Pin_6);
    
    LED1.set();
    LED2.set();
}    
    
    
void LED1_Toggle()
{
    
    GPIO LED1(GPIOE,GPIO_Pin_5);
    LED1.toggle();
    
}
    
void LED2_Toggle()
{
    
    GPIO LED2(GPIOE,GPIO_Pin_6);
    LED2.toggle();
    
}


    
void Uart_Init()
{
 
    GPIO Tx(GPIOA,GPIO_Pin_9);
    GPIO Rx(GPIOA,GPIO_Pin_10);
    UART uart1(&Rx,&Tx);
    uart1.inti_mode(115200,USART_WordLength_8b,USART_StopBits_1,USART_Parity_No,USART_Mode_ALL,USART_HardwareFlowControl_None);
    uart1.inti_it_turn(1,0,ENABLE,USART_IT_RXNE);
    
}    
    
    
void Key_Init()
{
    GPIO Key(GPIOE,GPIO_Pin_4);

    
    Key.mode(GPIO_Mode_IPU,GPIO_Speed_50MHz);
    
   EXTI_InitTypeDef EXTI_InitStructure;
   NVIC_InitTypeDef NVIC_InitStructure;
    
    NVIC_InitStructure.NVIC_IRQChannel = EXTI4_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);

    
    GPIO_EXTILineConfig(GPIO_PortSourceGPIOE, GPIO_PinSource4); 
    EXTI_InitStructure.EXTI_Line = EXTI_Line4;
    EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
    EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Falling;    
    EXTI_InitStructure.EXTI_LineCmd = ENABLE;
    EXTI_Init(&EXTI_InitStructure);    
    
}    
    
void Senor_Init()
{
    GPIO Senor1(GPIOD,GPIO_Pin_0); 
    Senor1.mode(GPIO_Mode_IN_FLOATING,GPIO_Speed_50MHz);
    
    GPIO Senor2(GPIOD,GPIO_Pin_1); 
    Senor2.mode(GPIO_Mode_IN_FLOATING,GPIO_Speed_50MHz);

    GPIO Senor3(GPIOD,GPIO_Pin_3); 
    Senor3.mode(GPIO_Mode_IN_FLOATING,GPIO_Speed_50MHz);

    GPIO Senor4(GPIOD,GPIO_Pin_5); 
    Senor4.mode(GPIO_Mode_IN_FLOATING,GPIO_Speed_50MHz);

    GPIO Senor5(GPIOD,GPIO_Pin_9); 
    Senor5.mode(GPIO_Mode_IN_FLOATING,GPIO_Speed_50MHz);
    
    GPIO Senor6(GPIOD,GPIO_Pin_10); 
    Senor6.mode(GPIO_Mode_IN_FLOATING,GPIO_Speed_50MHz);
    
    GPIO Senor7(GPIOD,GPIO_Pin_11); 
    Senor7.mode(GPIO_Mode_IN_FLOATING,GPIO_Speed_50MHz);

    GPIO Senor8(GPIOD,GPIO_Pin_12); 
    Senor8.mode(GPIO_Mode_IN_FLOATING,GPIO_Speed_50MHz);

    
    
}     









void OutPWM_Motor_Init()
{
   TIM_TimeBaseInitTypeDef	tim_base;
    
	tim_base.TIM_Prescaler=72-1;        //72分频
	tim_base.TIM_Period=1000-1;         //周期1000us
	tim_base.TIM_CounterMode=TIM_CounterMode_Up;    //向上记数
	tim_base.TIM_ClockDivision=TIM_CKD_DIV1;   //时钟不分频
	
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM1|RCC_APB2Periph_TIM8, ENABLE);
	TIM_TimeBaseInit(TIM1,&tim_base );
    TIM_TimeBaseInit(TIM8,&tim_base );
	TIM_ClearFlag(TIM1, TIM_FLAG_Update);
    TIM_ClearFlag(TIM8, TIM_FLAG_Update);
    
    TIM_OCInitTypeDef	tim_oc_mode;
	tim_oc_mode.TIM_OCMode=TIM_OCMode_PWM1;             //PWM输出模式
	tim_oc_mode.TIM_OutputState=TIM_OutputState_Enable; 
	tim_oc_mode.TIM_Pulse=0;                            //一开始的PWM为0
	tim_oc_mode.TIM_OCPolarity=TIM_OCPolarity_High;     //高电平为有效电平
	tim_oc_mode.TIM_OCIdleState=TIM_OCIdleState_Reset;
    
    TIM_OC1Init(TIM1,&tim_oc_mode);         
    TIM_OC2Init(TIM1,&tim_oc_mode);        
    TIM_OC3Init(TIM1,&tim_oc_mode);        
    TIM_OC4Init(TIM1,&tim_oc_mode);    

    TIM_OC1Init(TIM8,&tim_oc_mode);         
    TIM_OC2Init(TIM8,&tim_oc_mode);        
    TIM_OC3Init(TIM8,&tim_oc_mode);        
    TIM_OC4Init(TIM8,&tim_oc_mode);   
    
    TIM_OC1PreloadConfig(TIM1, TIM_OCPreload_Enable); 
    TIM_OC2PreloadConfig(TIM1, TIM_OCPreload_Enable); 
    TIM_OC3PreloadConfig(TIM1, TIM_OCPreload_Enable); 
    TIM_OC4PreloadConfig(TIM1, TIM_OCPreload_Enable); 
    
    TIM_OC1PreloadConfig(TIM8, TIM_OCPreload_Enable); 
    TIM_OC2PreloadConfig(TIM8, TIM_OCPreload_Enable); 
    TIM_OC3PreloadConfig(TIM8, TIM_OCPreload_Enable); 
    TIM_OC4PreloadConfig(TIM8, TIM_OCPreload_Enable); 
 
    TIM_CtrlPWMOutputs(TIM1,ENABLE);
    TIM_CtrlPWMOutputs(TIM8,ENABLE);        //高级定时器PWM输出设置
 
    TIM_Cmd(TIM1,ENABLE);       //开启定时器1  
    TIM_Cmd(TIM8,ENABLE);       //开启定时器8  
    
}



void GPIO_TIM1_Init()
{
    GPIO E11(GPIOE,GPIO_Pin_11);
    E11.mode(GPIO_Mode_AF_PP,GPIO_Speed_50MHz);
    GPIO E9(GPIOE,GPIO_Pin_9);
    E9.mode(GPIO_Mode_AF_PP,GPIO_Speed_50MHz);
    GPIO E13(GPIOE,GPIO_Pin_13);
    E13.mode(GPIO_Mode_AF_PP,GPIO_Speed_50MHz);
    GPIO E14(GPIOE,GPIO_Pin_14);
    E14.mode(GPIO_Mode_AF_PP,GPIO_Speed_50MHz);    
}


void GPIO_TIM8_Init()
{
    GPIO C6(GPIOC,GPIO_Pin_6);
    C6.mode(GPIO_Mode_AF_PP,GPIO_Speed_50MHz);
    GPIO C7(GPIOC,GPIO_Pin_7);
    C7.mode(GPIO_Mode_AF_PP,GPIO_Speed_50MHz);
    GPIO C8(GPIOC,GPIO_Pin_8);
    C8.mode(GPIO_Mode_AF_PP,GPIO_Speed_50MHz);    
    GPIO C9(GPIOC,GPIO_Pin_9);
    C9.mode(GPIO_Mode_AF_PP,GPIO_Speed_50MHz);   
}


void PWM_Init()
{
    GPIO_TIM1_Init();
    GPIO_TIM8_Init();
    OutPWM_Motor_Init();
}







void OLED_Init()
{
    OLED_GPIO  oled_def;
    oled_def.ID_Adress=0x3c;//OLED的从机地址
    oled_def.SCL=new GPIO(GPIOD,GPIO_Pin_8);
    oled_def.SDA=new GPIO(GPIOD,GPIO_Pin_7);
    OLED oled(&oled_def);								 
    oled.Init_Gpio();
    oled.Inti();
    
    oled.Printf(30,3,"Red  : ?");
    oled.Printf(30,4,"Blue : ?");
    oled.Printf(30,5,"Green: ?");
    oled.Printf(30,6,"Pos_X: 0");
    oled.Printf(30,7,"Pos_y: 0");

    

