PeepOrange/STM32F103ZET6_ogistics_handling_robot/User/config.cpp
    oled.ShowChinese(30,0,0);
    oled.ShowChinese(50,0,1);
    oled.ShowChinese(70,0,2);
    oled.ShowChinese(90,0,3);
    
    
    
    delete oled_def.SCL;
    delete oled_def.SDA;
}







void  Encoder_Inti()
{
	TIM_ICInitTypeDef       Encoder_ICInitStruct;
	TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure;
	 
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2|RCC_APB1Periph_TIM3|RCC_APB1Periph_TIM4|RCC_APB1Periph_TIM5, ENABLE);
	
    GPIO EncoderA(GPIOA,GPIO_Pin_0|GPIO_Pin_1|GPIO_Pin_6|GPIO_Pin_7|GPIO_Pin_15);
    GPIO EncoderB(GPIOB,GPIO_Pin_3|GPIO_Pin_6|GPIO_Pin_7);
    
	EncoderA.mode(GPIO_Mode_IN_FLOATING,GPIO_Speed_50MHz);
	EncoderB.mode(GPIO_Mode_IN_FLOATING,GPIO_Speed_50MHz);
	
    TIM_TimeBaseStructure.TIM_Prescaler=0x0;
    TIM_TimeBaseStructure.TIM_Period=65535;
    TIM_TimeBaseStructure.TIM_ClockDivision=TIM_CKD_DIV1;
    TIM_TimeBaseStructure.TIM_CounterMode=TIM_CounterMode_Up;
	
	TIM_TimeBaseInit(TIM2,&TIM_TimeBaseStructure);
    TIM_TimeBaseInit(TIM3,&TIM_TimeBaseStructure);
    TIM_TimeBaseInit(TIM4,&TIM_TimeBaseStructure);
    TIM_TimeBaseInit(TIM5,&TIM_TimeBaseStructure);
 
	TIM_EncoderInterfaceConfig(TIM2 , TIM_EncoderMode_TI12, TIM_ICPolarity_Rising,  TIM_ICPolarity_Rising);		//设置为编码器模式3
	TIM_EncoderInterfaceConfig(TIM3 , TIM_EncoderMode_TI12, TIM_ICPolarity_Rising,  TIM_ICPolarity_Rising);		//设置为编码器模式3
	TIM_EncoderInterfaceConfig(TIM4 , TIM_EncoderMode_TI12, TIM_ICPolarity_Rising,  TIM_ICPolarity_Rising);		//设置为编码器模式3
	TIM_EncoderInterfaceConfig(TIM5 , TIM_EncoderMode_TI12, TIM_ICPolarity_Rising,  TIM_ICPolarity_Rising);		//设置为编码器模式3


	TIM_ICStructInit(& Encoder_ICInitStruct);		//配置为通道1，上升沿触发，与上面相配
	
	Encoder_ICInitStruct.TIM_ICFilter=6;       //输入捕获滤波器
	Encoder_ICInitStruct.TIM_ICPolarity = TIM_ICPolarity_BothEdge;

	TIM_ICInit(TIM2, &Encoder_ICInitStruct);
	TIM_ICInit(TIM3, &Encoder_ICInitStruct);
	TIM_ICInit(TIM4, &Encoder_ICInitStruct);
	TIM_ICInit(TIM5, &Encoder_ICInitStruct);

	
	TIM_ClearFlag(TIM2,TIM_FLAG_Update);
	TIM_ClearFlag(TIM3,TIM_FLAG_Update);
	TIM_ClearFlag(TIM4,TIM_FLAG_Update);
	TIM_ClearFlag(TIM5,TIM_FLAG_Update);
	
	TIM_SetCounter(TIM2,0);
	TIM_SetCounter(TIM3,0);
	TIM_SetCounter(TIM4,0);
	TIM_SetCounter(TIM5,0);


//TIM_ITConfig(TIM2,TIM_IT_Update,ENABLE);   //若编码器记数超过最大65535，则开启中断在中断中处理超过部分

	TIM_Cmd(TIM2,ENABLE);    
	TIM_Cmd(TIM3,ENABLE);    
	TIM_Cmd(TIM4,ENABLE);    
	TIM_Cmd(TIM5,ENABLE);    
    
    
}



int Encoder_read(char TIMx)
{
	int Encoder_TIM;    
    if(TIMx==2)
    {
   Encoder_TIM= (short)TIM2 -> CNT;  
   TIM2 -> CNT=0;         
    }
    
    else if(TIMx==3)
    {
   Encoder_TIM= (short)TIM3 -> CNT;  
   TIM3-> CNT=0;           
    }
    
    else if(TIMx==4)
    {
   Encoder_TIM= (short)TIM4 -> CNT;  
   TIM4-> CNT=0;           
    }

    else if(TIMx==5)
    {
   Encoder_TIM= (short)TIM5 -> CNT;  
   TIM5-> CNT=0;           
    }    

   return Encoder_TIM;		
}


void UpLeft_PWM_Set(int16_t PWM)
{
    if(PWM>0)
    {
        TIM1->CCR1=PWM;
        TIM8->CCR1=0;
    }
    
    else
    {
        TIM8->CCR1=-PWM;
        TIM1->CCR1=0;        
        
    }   
}



void UpRight_PWM_Set(int16_t PWM)
{
    if(PWM>0)
    {
        TIM1->CCR3=PWM;
        TIM8->CCR3=0;
    }
    
    else
    {
        TIM8->CCR3=-PWM;
        TIM1->CCR3=0;        
        
    }   
}



void BackLeft_PWM_Set(int16_t PWM)
{
    if(PWM>0)
    {
        TIM1->CCR2=PWM;
        TIM8->CCR2=0;
    }
    
    else
    {
        TIM8->CCR2=-PWM;
        TIM1->CCR2=0;        
        
    }   
}


void BackRight_PWM_Set(int16_t PWM)
{
    if(PWM>0)
    {
        TIM1->CCR4=PWM;
        TIM8->CCR4=0;
    }
    
    else
    {
        TIM8->CCR4=-PWM;
        TIM1->CCR4=0;        
        
    }   
}



int16_t abs( int16_t x)
{
    return  (x>0?x:-x) ;
    
}

int16_t jud( int16_t x)
{
    return  (x>0?1:-1) ;
    
}


void Run_Stop()
{
     RightUp_PWM=0;
     RightBack_PWM=0;
     LeftUp_PWM=0;
     LeftBack_PWM=0;    
    UpLeft_PWM_Set(0); 
    BackLeft_PWM_Set(0); 
    UpRight_PWM_Set(0); 
    BackRight_PWM_Set(0);     
    
}



void PID_PWM_Adujust(int16_t PWM1,int16_t PWM2,int16_t PWM3,int16_t PWM4)       //左前  左后   右前  右后
{
    int16_t Set_PWM;
   
    LeftUp_PID_Mortor.goal_point=abs(PWM1)*K_PWM_Encoder;
    LeftUp_PID_Mortor.read_point=jud(PWM1)*Encoder_read(2);
    Set_PWM=PID_Out(&LeftUp_PID_Mortor)/K_PWM_Encoder;    
    if(Set_PWM>1000)
        Set_PWM=1000;
    else if(Set_PWM<0)
        Set_PWM=0;
    UpLeft_PWM_Set(Set_PWM * jud(PWM1)); 
    
    LeftBack_PID_Mortor.goal_point=abs(PWM2)*K_PWM_Encoder;
    LeftBack_PID_Mortor.read_point=jud(PWM2)*Encoder_read(3);
    Set_PWM=PID_Out(&LeftBack_PID_Mortor)/K_PWM_Encoder;    
    if(Set_PWM>1000)
        Set_PWM=1000;
    else if(Set_PWM<0)
        Set_PWM=0;
    BackLeft_PWM_Set(Set_PWM*jud(PWM2)); 


    RightUp_PID_Mortor.goal_point=abs(PWM3)*K_PWM_Encoder;
    RightUp_PID_Mortor.read_point=jud(PWM3)*Encoder_read(4);
    Set_PWM=PID_Out(&RightUp_PID_Mortor)/K_PWM_Encoder;    
    if(Set_PWM>1000)
        Set_PWM=1000;
    else if(Set_PWM<0)
        Set_PWM=0;
    UpRight_PWM_Set(Set_PWM*jud(PWM3)); 


    RightBack_PID_Mortor.goal_point=abs(PWM4)*K_PWM_Encoder;
    RightBack_PID_Mortor.read_point=jud(PWM4)*Encoder_read(5);
    Set_PWM=PID_Out(&RightBack_PID_Mortor)/K_PWM_Encoder;    
    if(Set_PWM>1000)
        Set_PWM=1000;
    else if(Set_PWM<0)
        Set_PWM=0;
    BackRight_PWM_Set(Set_PWM*jud(PWM4));     
    
}


void TIM6_Inti()					//开启定时器6，每次记数1us，记5000次数更新，即5ms，更新时产生中断，中断优先级为1：1
{
	
	TIM_TimeBaseInitTypeDef	TIM6_DriverStruct;
	NVIC_InitTypeDef	    TIM6_ITStruct;
	
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM6, ENABLE);
	TIM6_DriverStruct.TIM_Prescaler=35;						//APB1时钟线是36MHZ,故为35
	TIM6_DriverStruct.TIM_CounterMode=TIM_CounterMode_Up;
	TIM6_DriverStruct.TIM_Period=Reset_Time;
	TIM6_DriverStruct.TIM_ClockDivision=TIM_CKD_DIV1;
	
	TIM6_ITStruct.NVIC_IRQChannel=TIM6_IRQn;
	TIM6_ITStruct.NVIC_IRQChannelCmd=ENABLE;
	TIM6_ITStruct.NVIC_IRQChannelPreemptionPriority=1;
	TIM6_ITStruct.NVIC_IRQChannelSubPriority=1;
	
	TIM_TimeBaseInit(TIM6, &TIM6_DriverStruct);
	TIM_ITConfig(TIM6,TIM_IT_Update ,ENABLE);
	NVIC_Init(&TIM6_ITStruct);
	
