PeepOrange/STM32F103ZET6_ogistics_handling_robot/User/config.cpp
	TIM_ClearFlag(TIM6, TIM_FLAG_Update);
	TIM_Cmd(TIM6,ENABLE);	
}




void TIM7_Inti()					//开启定时器7，每次记数1us，记100次数更新，即0.1ms，更新时产生中断，中断优先级为1：1
{
	
	TIM_TimeBaseInitTypeDef	TIM7_DriverStruct;
	NVIC_InitTypeDef	    TIM7_ITStruct;
	
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM7, ENABLE);
	TIM7_DriverStruct.TIM_Prescaler=35;						//APB1时钟线是36MHZ,故为35
	TIM7_DriverStruct.TIM_CounterMode=TIM_CounterMode_Up;
	TIM7_DriverStruct.TIM_Period=100;
	TIM7_DriverStruct.TIM_ClockDivision=TIM_CKD_DIV1;
	
	TIM7_ITStruct.NVIC_IRQChannel=TIM7_IRQn;
	TIM7_ITStruct.NVIC_IRQChannelCmd=ENABLE;
	TIM7_ITStruct.NVIC_IRQChannelPreemptionPriority=1;
	TIM7_ITStruct.NVIC_IRQChannelSubPriority=1;
	
	TIM_TimeBaseInit(TIM7, &TIM7_DriverStruct);
	TIM_ITConfig(TIM7,TIM_IT_Update ,ENABLE);
	NVIC_Init(&TIM7_ITStruct);
	
	TIM_ClearFlag(TIM7, TIM_FLAG_Update);
	TIM_Cmd(TIM7,ENABLE);	
}



void Steering_engine_gpio_Init()
{
     GPIO Steering_engine_gpio(GPIOC,GPIO_Pin_0|GPIO_Pin_1|GPIO_Pin_2|GPIO_Pin_3);   
     Steering_engine_gpio.mode(GPIO_Mode_Out_PP,GPIO_Speed_50MHz);
}



void Steering_engine_Init()
{
    Steering_engine_gpio_Init();
    TIM7_Inti();
}

void Steering_engine_angle_set()
{
    
    
}



void Run_Up()
{
      if(!GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_0)&&!GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_1))
      {
         RightUp_PWM=Goal_PWM;
         RightBack_PWM=Goal_PWM;
         LeftUp_PWM=Goal_PWM;
         LeftBack_PWM=Goal_PWM;               
      }                 
     else if(!GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_0))     //前左  右前      低电平（即检测到黑线）
     {
         RightUp_PWM=Correct_Up_PWM;
         RightBack_PWM=Correct_Up_PWM;
         LeftUp_PWM=Correct_Back_PWM;
         LeftBack_PWM=Correct_Back_PWM;
     }

     else if(!GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_1))    //前右  右后
     {
         RightUp_PWM=Correct_Back_PWM;
         RightBack_PWM=Correct_Back_PWM;
         LeftUp_PWM=Correct_Up_PWM;
         LeftBack_PWM=Correct_Up_PWM;
     }
     
     else
     {
         RightUp_PWM=Goal_PWM;
         RightBack_PWM=Goal_PWM;
         LeftUp_PWM=Goal_PWM;
         LeftBack_PWM=Goal_PWM;                  
     }        
       
}

void Run_Right()
{
      
 
      if(!GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_11)&&!GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_12)&&!GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_3)&&!GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_5))
      {
         RightUp_PWM=Goal_PWM;
         RightBack_PWM=-Goal_PWM;
         LeftUp_PWM=-Goal_PWM;
         LeftBack_PWM=Goal_PWM;              
      }                 
      else if(GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_11)&&!GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_12)&&!GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_3)&&GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_5))
      {
         RightUp_PWM=Correct_Up_PWM;
         RightBack_PWM=Correct_Up_PWM;
         LeftUp_PWM=Correct_Back_PWM;
         LeftBack_PWM=Correct_Back_PWM;                   
      }
      else if(!GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_11)&&GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_12)&&GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_3)&&!GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_5))
      {
         RightUp_PWM=Correct_Back_PWM;
         RightBack_PWM=Correct_Back_PWM;
         LeftUp_PWM=Correct_Up_PWM;
         LeftBack_PWM=Correct_Up_PWM;             
      }     
      else if(!GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_11)&&GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_12)&&GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_3)&&GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_5))
      {
         RightUp_PWM=Correct_Back_PWM;
         RightBack_PWM=Correct_Back_PWM;
         LeftUp_PWM=Correct_Up_PWM;
         LeftBack_PWM=Correct_Up_PWM;             
          
      }

      else if(GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_11)&&!GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_12)&&GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_3)&&GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_5))
      {
         RightUp_PWM=Correct_Up_PWM;
         RightBack_PWM=Correct_Up_PWM;
         LeftUp_PWM=Correct_Back_PWM;
         LeftBack_PWM=Correct_Back_PWM;                     
      }
      
      else if(GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_11)&&GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_12)&&!GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_3)&&GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_5))
      {
         RightUp_PWM=Correct_Up_PWM;
         RightBack_PWM=Correct_Up_PWM;
         LeftUp_PWM=Correct_Back_PWM;
         LeftBack_PWM=Correct_Back_PWM;                     
      }
      
      
      else if(GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_11)&&GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_12)&&GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_3)&&!GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_5))
      {
         RightUp_PWM=Correct_Back_PWM;
         RightBack_PWM=Correct_Back_PWM;
         LeftUp_PWM=Correct_Up_PWM;
         LeftBack_PWM=Correct_Up_PWM;                      
      } 

      else if(!GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_11)&&GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_12)&&!GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_3)&&GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_5))
      {
         RightUp_PWM=Goal_PWM;
         RightBack_PWM=Goal_PWM;
         LeftUp_PWM=Goal_PWM;
         LeftBack_PWM=Goal_PWM;                       
      }       
      
      else if(GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_11)&&!GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_12)&&GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_3)&&!GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_5))
      {
         RightUp_PWM=-Goal_PWM;
         RightBack_PWM=-Goal_PWM;
         LeftUp_PWM=-Goal_PWM;
         LeftBack_PWM=-Goal_PWM;                     
      }       


      else if(!GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_3)&&!GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_5))
      {
         RightUp_PWM=Correct_Up_PWM;
         RightBack_PWM=Correct_Up_PWM;
         LeftUp_PWM=Correct_Back_PWM;
         LeftBack_PWM=Correct_Back_PWM;                       
      }       
      
      
      
      
     else
     {
         RightUp_PWM=Goal_PWM;
         RightBack_PWM=-Goal_PWM;
         LeftUp_PWM=-Goal_PWM;
         LeftBack_PWM=Goal_PWM;                  
     }        


