PeepOrange/STM32F103ZET6_ogistics_handling_robot/User/config.cpp
}




void Run_Left()
{
      if(!GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_11)&&!GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_12)&&!GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_3)&&!GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_5))
      {
         RightUp_PWM=-Goal_PWM;
         RightBack_PWM=Goal_PWM;
         LeftUp_PWM=Goal_PWM;
         LeftBack_PWM=-Goal_PWM;              
      }                 
      else if(GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_11)&&!GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_12)&&!GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_3)&&GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_5))
      {
         RightUp_PWM=Correct_Up_PWM;
         RightBack_PWM=Correct_Up_PWM;
         LeftUp_PWM=Correct_Back_PWM;
         LeftBack_PWM=Correct_Back_PWM;                   
      }
      else if(!GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_11)&&GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_12)&&GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_3)&&!GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_5))
      {
         RightUp_PWM=Correct_Back_PWM;
         RightBack_PWM=Correct_Back_PWM;
         LeftUp_PWM=Correct_Up_PWM;
         LeftBack_PWM=Correct_Up_PWM;             
      }     
      else if(!GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_11)&&GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_12)&&GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_3)&&GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_5))
      {
         RightUp_PWM=Correct_Back_PWM;
         RightBack_PWM=Correct_Back_PWM;
         LeftUp_PWM=Correct_Up_PWM;
         LeftBack_PWM=Correct_Up_PWM;             
          
      }

      else if(GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_11)&&!GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_12)&&GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_3)&&GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_5))
      {
         RightUp_PWM=Correct_Up_PWM;
         RightBack_PWM=Correct_Up_PWM;
         LeftUp_PWM=Correct_Back_PWM;
         LeftBack_PWM=Correct_Back_PWM;                     
      }
      
      else if(GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_11)&&GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_12)&&!GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_3)&&GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_5))
      {
         RightUp_PWM=Correct_Up_PWM;
         RightBack_PWM=Correct_Up_PWM;
         LeftUp_PWM=Correct_Back_PWM;
         LeftBack_PWM=Correct_Back_PWM;                     
      }
      
      
      else if(GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_11)&&GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_12)&&GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_3)&&!GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_5))
      {
         RightUp_PWM=Correct_Back_PWM;
         RightBack_PWM=Correct_Back_PWM;
         LeftUp_PWM=Correct_Up_PWM;
         LeftBack_PWM=Correct_Up_PWM;                      
      } 

      else if(!GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_11)&&GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_12)&&!GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_3)&&GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_5))
      {
         RightUp_PWM=Goal_PWM;
         RightBack_PWM=Goal_PWM;
         LeftUp_PWM=Goal_PWM;
         LeftBack_PWM=Goal_PWM;                       
      }       
      
      else if(GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_11)&&!GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_12)&&GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_3)&&!GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_5))
      {
         RightUp_PWM=-Goal_PWM;
         RightBack_PWM=-Goal_PWM;
         LeftUp_PWM=-Goal_PWM;
         LeftBack_PWM=-Goal_PWM;                     
      }       


      else if(!GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_3)&&!GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_5))
      {
         RightUp_PWM=Correct_Up_PWM;
         RightBack_PWM=Correct_Up_PWM;
         LeftUp_PWM=Correct_Back_PWM;
         LeftBack_PWM=Correct_Back_PWM;                       
      }       
      
      
      
      
     else
     {
         RightUp_PWM=-Goal_PWM;
         RightBack_PWM=Goal_PWM;
         LeftUp_PWM=Goal_PWM;
         LeftBack_PWM=-Goal_PWM;                  
     }        
       
}




void Run_Back()
{
      if(!GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_9)&&!GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_10))
      {
         RightUp_PWM=-Goal_PWM;
         RightBack_PWM=-Goal_PWM;
         LeftUp_PWM=-Goal_PWM;
         LeftBack_PWM=-Goal_PWM;               
      }                 
     else if(!GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_9))     //前左  右前      低电平（即检测到黑线）
     {
         RightUp_PWM=Correct_Up_PWM;
         RightBack_PWM=Correct_Up_PWM;
         LeftUp_PWM=Correct_Back_PWM;
         LeftBack_PWM=Correct_Back_PWM;        
     }

     else if(!GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_10))    //前右  右后
     {
         RightUp_PWM=Correct_Back_PWM;
         RightBack_PWM=Correct_Back_PWM;
         LeftUp_PWM=Correct_Up_PWM;
         LeftBack_PWM=Correct_Up_PWM;       
     }
     
     else
     {
         RightUp_PWM=-Goal_PWM;
         RightBack_PWM=-Goal_PWM;
         LeftUp_PWM=-Goal_PWM;
         LeftBack_PWM=-Goal_PWM;                  
     }        
       
}






void Up_Position()
{
    OS_ERR err;
    if(GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_3)&&GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_5))
    {
    Pos_Y++; 
    OLED_GPIO  oled_def;
    oled_def.ID_Adress=0x3c;//OLED的从机地址
    oled_def.SCL=new GPIO(GPIOD,GPIO_Pin_8);
    oled_def.SDA=new GPIO(GPIOD,GPIO_Pin_7);
    OLED oled(&oled_def);	
    oled.Printf(72,7,"%d",Pos_Y);
    delete oled_def.SCL;
    delete oled_def.SDA;  
    OSTimeDly(500,OS_OPT_TIME_DLY,&err);        
    }        
    
}


void Left_Position()
{
    if(GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_0)&&GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_1)&&GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_9)&&GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_10))
    { 
    Pos_X--; 
    OLED_GPIO  oled_def;
    oled_def.ID_Adress=0x3c;//OLED的从机地址
    oled_def.SCL=new GPIO(GPIOD,GPIO_Pin_8);
    oled_def.SDA=new GPIO(GPIOD,GPIO_Pin_7);
    OLED oled(&oled_def);	
    oled.Printf(72,6,"%d",Pos_X);
    delete oled_def.SCL;
    delete oled_def.SDA;    
    }        
}

void Right_Position()
{
    if(GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_0)&&GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_1)&&GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_9)&&GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_10))
    {
    Pos_X++;  
    OLED_GPIO  oled_def;
    oled_def.ID_Adress=0x3c;//OLED的从机地址
    oled_def.SCL=new GPIO(GPIOD,GPIO_Pin_8);
    oled_def.SDA=new GPIO(GPIOD,GPIO_Pin_7);
    OLED oled(&oled_def);	
    oled.Printf(72,6,"%d",Pos_X);
    delete oled_def.SCL;
    delete oled_def.SDA;       
    }
}


void Back_Position()
{
    if(GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_3)&&GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_5)&&GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_11)&&GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_12))
    {
    Pos_Y--;  
    OLED_GPIO  oled_def;
    oled_def.ID_Adress=0x3c;//OLED的从机地址
    oled_def.SCL=new GPIO(GPIOD,GPIO_Pin_8);
    oled_def.SDA=new GPIO(GPIOD,GPIO_Pin_7);
    OLED oled(&oled_def);	
    oled.Printf(72,7,"%d",Pos_Y);
    delete oled_def.SCL;
    delete oled_def.SDA;       
    }
}


#ifdef __cplusplus
}
#endif 












